In [50]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
%matplotlib inline

# Global Variable Declaration/Misc

In [51]:
regex = re.compile('[@_!#$%^&*()<>?/\|}{~:]')

# Load Data

In [86]:
df_budgets = pd.read_csv('data/tn.movie_budgets.csv.gz') # GROSS & NAMES
df_imdb_basics = pd.read_csv('data/imdb.title.basics.csv.gz') # GENRES & NAMES
df_tmdb = pd.read_csv('data/tmdb.movies.csv.gz') # POPULAITY, NAMES
imdb_ratings = pd.read_csv('data/imdb.title.ratings.csv.gz') # T constant #n constant #rating
imdb_name = pd.read_csv('data/imdb.name.basics.csv.gz') # director/actor names, # n constant, # t constant
imdb_crew = pd.read_csv('data/imdb.title.crew.csv.gz') # Director n constant, t constant 
rt_info = pd.read_csv('data/rt.movie_info.tsv.gz', delimiter = '\t') # Director names

In [99]:
imdb_crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [ ]:
df_imdb_basics.head()

# Visualize/Explore Data

### <span style='color:red'>------BOM DF</span>

In [72]:
print(df_bom.shape, '\n')
print(df_bom.info())
df_bom.head()

(3387, 6)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 6 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
title_CLEANED     3387 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 158.8+ KB
None

,title,studio,domestic_gross,foreign_gross,year,title_CLEANED
0,Toy Story 3,BV,415000000.0,652000000,2010,Toy Story 3
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010,Alice in Wonderland 2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010,Harry Potter and the Deathly Hallows Part 1
3,Inception,WB,292600000.0,535700000,2010,Inception
4,Shrek Forever After,P/DW,238700000.0,513900000,2010,Shrek Forever After

### <span style='color:red'>------BUDGETS DF</span>

In [85]:
print(df_budgets.shape, '\n')
print(df_budgets.info())
df_budgets.head()

(5782, 7)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 7 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
title_CLEANED        5782 non-null object
dtypes: int64(1), object(6)
memory usage: 316.3+ KB
None

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,title_CLEANED
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",avatar
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",pirates of the caribbean on stranger tides
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",dark phoenix
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",avengers age of ultron
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",star wars ep. viii the last jedi

# Clean Data

### <span style='color:red'>------BOM DF</span>

In [79]:
df_bom['title_CLEANED'] = df_bom['title'].apply(lambda x: x.lower())
df_bom['title_CLEANED'] = df_bom['title_CLEANED'].apply(lambda x: re.sub('[@_!#$%^&*()<>?/\|}{~:]', '', x))

### <span style='color:red'>------BUDGETS DF</span>

In [84]:
df_budgets['title_CLEANED'] = df_budgets['movie'].apply(lambda x: x.lower())
df_budgets['title_CLEANED'] = df_budgets['title_CLEANED'].apply(lambda x: re.sub('[@_!#$%^&*()<>?/\|}{~:]', '', x))

# Merge Data

In [80]:
df_bom_akas = pd.merge(df_imdb_akas, df_bom,  on="title_CLEANED")
df_bom_akas = pd.merge(df_imdb_akas, df_bom,  on="title_CLEANED")